tutorials/fluid/helmholtzResonance/system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

probes
{
    libs            ("libsampling.so");
    type            probes;
    name            probes;
    writeControl    timeStep;
    writeInterval   1;
    fields          (p);
    probeLocations
    (
        ( -0.045  0     0     )
        ( -0.045  0.020 0     )
        ( -0.010  0     0     )
        (  0.0125 0     0     )
        (  0.0125 0.020 0     )
    );
}

// ************************************************************************* //
